#### `terragrunt run-all plan` Success
<details><summary>Show Output</summary>

```


No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.this: Refreshing state... [id=folders/692745425625]
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.this: Refreshing state... [id=folders/430824589187]

google_folder.this: Refreshing state... [id=folders/34959545008]
google_folder.env: Refreshing state... [id=folders/605914450685]
google_folder.env: Refreshing state... [id=folders/978739234566]
google_folder.env: Refreshing state... [id=folders/512817110928]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.



No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "transport-stg"
      + network        = "transport-stg"
      + project        = "bon-transport-stg-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "transport-stg"
      + network            = "transport-stg"
      + project            = "bon-transport-stg-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64513

          + advertised_ip_ranges {
              + range = "10.0.4.0/22"
            }
        }
    }

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "512817110928"
      + id                  = (known after apply)
      + name                = "bon-transport-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-transport-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-stg-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "transport-stg"
      + project                         = "bon-transport-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ vpn = {
      ~ asn     = "13" -> "64513"
      ~ cr      = {
          - bgp                = [
              - {
                  - advertise_mode       = "CUSTOM"
                  - advertised_groups    = []
                  - advertised_ip_ranges = [
                      - {
                          - description = null
                          - range       = "10.0.4.0/22"
                        },
                    ]
                  - asn                  = 64513
                },
            ]
          - creation_timestamp = null
          - description        = null
          - id                 = null
          - name               = "transport-stg"
          - network            = "transport-stg"
          - project            = "bon-transport-stg-007"
          - region             = null
          - self_link          = null
          - timeouts           = null
        } -> (known after apply)
      ~ gw      = "transport-stg" -> (known after apply)

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

      ~ project = "bon-transport-stg-007" -> "bon-transport-stg-07"
    }

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "transport-dev"
      + network        = "transport-dev"
      + project        = "bon-transport-dev-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "transport-dev"
      + network            = "transport-dev"
      + project            = "bon-transport-dev-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64512

          + advertised_ip_ranges {
              + range = "10.0.0.0/22"
            }
        }
    }

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01C4CA-74671D-650411"
      + folder_id           = "605914450685"
      + id                  = (known after apply)
      + name                = "bon-transport-dev"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-transport-dev-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-dev-07"
      + service            = "storage-api.googleapis.com"
    }

sequence from the end of this expression, leaving just the inner expression.

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "transport-prd"
      + network        = "transport-prd"
      + project        = "bon-transport-prd-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "transport-prd"
      + network            = "transport-prd"
      + project            = "bon-transport-prd-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64514

          + advertised_ip_ranges {
              + range = "10.0.8.0/22"
            }
        }
    }

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01B482-A5BF15-428E53"
      + folder_id           = "978739234566"
      + id                  = (known after apply)
      + name                = "bon-transport-prd"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-transport-prd-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-transport-prd-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "transport-prd"
      + project                         = "bon-transport-prd-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ vpn = {
      ~ asn     = "14" -> "64514"
      ~ cr      = {
          - bgp                = [
              - {
                  - advertise_mode       = "CUSTOM"
                  - advertised_groups    = []
                  - advertised_ip_ranges = [
                      - {
                          - description = ""
                          - range       = "10.0.8.0/22"
                        },
                    ]
                  - asn                  = 64514
                },
            ]
          - creation_timestamp = "2021-02-14T18:38:18.679-08:00"
          - description        = ""
          - id                 = "projects/bon-transport-prd-007/regions/us-central1/routers/transport-prd"
          - name               = "transport-prd"
          - network            = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-007/global/networks/transport-prd"
          - project            = "bon-transport-prd-007"
          - region             = "us-central1"
          - self_link          = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-007/regions/us-central1/routers/transport-prd"
          - timeouts           = null
        } -> (known after apply)
      ~ gw      = "transport-prd" -> (known after apply)
      ~ project = "bon-transport-prd-007" -> "bon-transport-prd-07"
    }

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


google_folder.env: Refreshing state... [id=folders/651638536948]
google_folder.env: Refreshing state... [id=folders/684816684596]
google_folder.env: Refreshing state... [id=folders/889070619480]
google_folder.projects: Refreshing state... [id=folders/452810046894]
google_folder.projects: Refreshing state... [id=folders/366493767935]
google_folder.projects: Refreshing state... [id=folders/239339018442]
google_folder.projects: Refreshing state... [id=folders/487920024190]
google_folder.projects: Refreshing state... [id=folders/75950899404]
google_folder.projects: Refreshing state... [id=folders/435506212668]
google_folder.projects: Refreshing state... [id=folders/484336764183]





An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01B482-A5BF15-428E53"
      + folder_id           = "575000724624"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-a-prd"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-a-prd-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-prd-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-a-prd"
      + project                         = "bon-dept-squad-a-prd-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-a-prd-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-a-dev"
      + project                         = "bon-dept-squad-a-dev-07"
      + routing_mode                    = "GLOBAL"

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "354041018976"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-b-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-b-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + self_link                       = (known after apply)
      + project            = "bon-dept-squad-b-stg-07"
      + service            = "cloudbilling.googleapis.com"
    }

    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-b-stg-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-a-dev-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "150578772375"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-a-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-a-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-a-stg-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-a-stg"
      + project                         = "bon-dept-squad-a-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-a-stg-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "889070619480"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-c-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-c-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-stg-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-c-stg"
      + project                         = "bon-dept-squad-c-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-c-stg-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "bon-dept-squad-c-dev-07"
      + service            = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-c-dev"
      + project                         = "bon-dept-squad-c-dev-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-c-dev-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

```

</details>

*Workflow: `Plan Boniface GCP Org`, Action: `bonifaceltdterragrunt-github-actions3`, Working Directory: `.`, Workspace: `default`*
